//1进制转换：
//转换法则：除以d倒取余
//例：十进制159转换8进制，159除8得19余7，19除8得2余3，2除8得0余2.所以159得八进制就是237
//和栈得关系是？依次放入7，3，2进入栈中，然后依次拿出得到8进制得159，即237 。满足栈后进先出得特性

//2.括号匹配的检验
//假设表达式中有圆括号和方括号，只要能够对应两两配对，就是匹配成功
//例子：(()])。左括号挪入栈中，现在就是((,于是和)匹配，最上面的(拿出，剩下的(和]匹配，匹配失败

//3表达式求值
//由运算符优先级确定运算顺序的对表达式求值算法
// 表达式的组成 操作数(operand)：常数、变量。
// 运算符(operator)：算术运算符、关系运算符和逻辑运算符。界限符(delimiter)：左右括弧和表达式结束符
//需要两个栈，算符站OPTR用于寄存运算符，操作数栈OPND用于寄存运算数和运算结果

//下面的这部分我感觉比较莫名奇妙
// 当扫描到的是运算符时
// • 若这个运算符比OPTR栈顶运算符的优先级高，则入栈OPTR，继续向后处理
// • 若这个运算符比OPTR栈顶运算符优先级低，则从OPND栈中弹出两个运算数，从栈
// OPTR中弹出栈顶运算符进行运算，并将运算结果压入栈OPND。

//4.舞伴问题
//男女分别排成一排，各自从队头出一人配对，如果人数不同。就等待下一次
//两个队列分别储存男女，具有先进先出的特性